susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32L49x.h
#define I2C4_SMBA_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF5
#define I2C4_SMBA_PD11_ PD11,GPIO_AF4
#define I2C4_SMBA_PF13_ PF13,GPIO_AF4
#define _I2C4_SMBA_PA14 (JTCK/SWCLK)_ 1
#define _I2C4_SMBA_PD11_ 1
#define _I2C4_SMBA_PF13_ 1

#define IR_OUT_PA13 (JTMS/SWDIO)_ PA13 (JTMS/SWDIO),GPIO_AF1
#define IR_OUT_PB9_ PB9,GPIO_AF1
#define _IR_OUT_PA13 (JTMS/SWDIO)_ 1
#define _IR_OUT_PB9_ 1

#define LCD_COM0_PA8_ PA8,GPIO_AF11
#define _LCD_COM0_PA8_ 1

#define LCD_COM1_PA9_ PA9,GPIO_AF11
#define _LCD_COM1_PA9_ 1

#define LCD_COM2_PA10_ PA10,GPIO_AF11
#define _LCD_COM2_PA10_ 1

#define LCD_COM3_PB9_ PB9,GPIO_AF11
#define _LCD_COM3_PB9_ 1

#define LCD_COM4_PC10_ PC10,GPIO_AF11
#define _LCD_COM4_PC10_ 1

#define LCD_COM5_PC11_ PC11,GPIO_AF11
#define _LCD_COM5_PC11_ 1

#define LCD_COM6_PC12_ PC12,GPIO_AF11
#define _LCD_COM6_PC12_ 1

#define LCD_COM7_PD2_ PD2,GPIO_AF11
#define _LCD_COM7_PD2_ 1

#define LCD_SEG0_PA1_ PA1,GPIO_AF11
#define _LCD_SEG0_PA1_ 1

#define LCD_SEG1_PA2_ PA2,GPIO_AF11
#define _LCD_SEG1_PA2_ 1

#define LCD_SEG10_PB10_ PB10,GPIO_AF11
#define _LCD_SEG10_PB10_ 1

#define LCD_SEG11_PB11_ PB11,GPIO_AF11
#define _LCD_SEG11_PB11_ 1

#define LCD_SEG12_PB12_ PB12,GPIO_AF11
#define _LCD_SEG12_PB12_ 1

#define LCD_SEG13_PB13_ PB13,GPIO_AF11
#define _LCD_SEG13_PB13_ 1

#define LCD_SEG14_PB14_ PB14,GPIO_AF11
#define _LCD_SEG14_PB14_ 1

#define LCD_SEG15_PB15_ PB15,GPIO_AF11
#define _LCD_SEG15_PB15_ 1

#define LCD_SEG16_PB8_ PB8,GPIO_AF11
#define _LCD_SEG16_PB8_ 1

#define LCD_SEG17_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF11
#define _LCD_SEG17_PA15 (JTDI)_ 1

#define LCD_SEG18_PC0_ PC0,GPIO_AF11
#define _LCD_SEG18_PC0_ 1

#define LCD_SEG19_PC1_ PC1,GPIO_AF11
#define _LCD_SEG19_PC1_ 1

#define LCD_SEG2_PA3_ PA3,GPIO_AF11
#define _LCD_SEG2_PA3_ 1

#define LCD_SEG20_PC2_ PC2,GPIO_AF11
#define _LCD_SEG20_PC2_ 1

#define LCD_SEG21_PB7_ PB7,GPIO_AF11
#define _LCD_SEG21_PB7_ 1

#define LCD_SEG22_PC4_ PC4,GPIO_AF11
#define _LCD_SEG22_PC4_ 1

#define LCD_SEG23_PC5_ PC5,GPIO_AF11
#define _LCD_SEG23_PC5_ 1

#define LCD_SEG24_PC6_ PC6,GPIO_AF11
#define _LCD_SEG24_PC6_ 1

#define LCD_SEG25_PC7_ PC7,GPIO_AF11
#define _LCD_SEG25_PC7_ 1

#define LCD_SEG26_PC8_ PC8,GPIO_AF11
#define _LCD_SEG26_PC8_ 1

#define LCD_SEG27_PC9_ PC9,GPIO_AF11
#define _LCD_SEG27_PC9_ 1

#define LCD_SEG28_PC10_ PC10,GPIO_AF11
#define LCD_SEG28_PD8_ PD8,GPIO_AF11
#define _LCD_SEG28_PC10_ 1
#define _LCD_SEG28_PD8_ 1

#define LCD_SEG29_PC11_ PC11,GPIO_AF11
#define LCD_SEG29_PD9_ PD9,GPIO_AF11
#define _LCD_SEG29_PC11_ 1
#define _LCD_SEG29_PD9_ 1

#define LCD_SEG3_PA6_ PA6,GPIO_AF11
#define _LCD_SEG3_PA6_ 1

#define LCD_SEG30_PC12_ PC12,GPIO_AF11
#define LCD_SEG30_PD10_ PD10,GPIO_AF11
#define _LCD_SEG30_PC12_ 1
#define _LCD_SEG30_PD10_ 1

#define LCD_SEG31_PD11_ PD11,GPIO_AF11
#define LCD_SEG31_PD2_ PD2,GPIO_AF11
#define _LCD_SEG31_PD11_ 1
#define _LCD_SEG31_PD2_ 1

#define LCD_SEG32_PD12_ PD12,GPIO_AF11
#define _LCD_SEG32_PD12_ 1

#define LCD_SEG33_PD13_ PD13,GPIO_AF11
#define _LCD_SEG33_PD13_ 1

#define LCD_SEG34_PD14_ PD14,GPIO_AF11
#define _LCD_SEG34_PD14_ 1

#define LCD_SEG35_PD15_ PD15,GPIO_AF11
#define _LCD_SEG35_PD15_ 1

#define LCD_SEG36_PE0_ PE0,GPIO_AF11
#define _LCD_SEG36_PE0_ 1

#define LCD_SEG37_PE1_ PE1,GPIO_AF11
#define _LCD_SEG37_PE1_ 1

#define LCD_SEG38_PE2_ PE2,GPIO_AF11
#define _LCD_SEG38_PE2_ 1

#define LCD_SEG39_PE3_ PE3,GPIO_AF11
#define _LCD_SEG39_PE3_ 1

#define LCD_SEG4_PA7_ PA7,GPIO_AF11
#define _LCD_SEG4_PA7_ 1

#define LCD_SEG40_PC10_ PC10,GPIO_AF11
#define _LCD_SEG40_PC10_ 1

#define LCD_SEG41_PC11_ PC11,GPIO_AF11
#define _LCD_SEG41_PC11_ 1

#define LCD_SEG42_PC12_ PC12,GPIO_AF11
#define _LCD_SEG42_PC12_ 1

#define LCD_SEG43_PD2_ PD2,GPIO_AF11
#define _LCD_SEG43_PD2_ 1

#define LCD_SEG5_PB0_ PB0,GPIO_AF11
#define _LCD_SEG5_PB0_ 1

#define LCD_SEG6_PB1_ PB1,GPIO_AF11
#define _LCD_SEG6_PB1_ 1

#define LCD_SEG7_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF11
#define _LCD_SEG7_PB3 (JTDO/TRACESWO)_ 1

#define LCD_SEG8_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF11
#define _LCD_SEG8_PB4 (NJTRST)_ 1

#define LCD_SEG9_PB5_ PB5,GPIO_AF11
#define _LCD_SEG9_PB5_ 1

#define LCD_VLCD_PB2_ PB2,GPIO_AF11
#define LCD_VLCD_PC3_ PC3,GPIO_AF11
#define _LCD_VLCD_PB2_ 1
#define _LCD_VLCD_PC3_ 1

#define LPTIM1_ETR_PB6_ PB6,GPIO_AF1
#define LPTIM1_ETR_PC3_ PC3,GPIO_AF1
#define LPTIM1_ETR_PG12_ PG12,GPIO_AF1
#define _LPTIM1_ETR_PB6_ 1
#define _LPTIM1_ETR_PC3_ 1
#define _LPTIM1_ETR_PG12_ 1

#define LPTIM1_IN1_PB5_ PB5,GPIO_AF1
#define LPTIM1_IN1_PC0_ PC0,GPIO_AF1
#define LPTIM1_IN1_PG10_ PG10,GPIO_AF1
#define _LPTIM1_IN1_PB5_ 1
#define _LPTIM1_IN1_PC0_ 1
#define _LPTIM1_IN1_PG10_ 1

#define LPTIM1_IN2_PB7_ PB7,GPIO_AF1
#define LPTIM1_IN2_PC2_ PC2,GPIO_AF1
#define LPTIM1_IN2_PG11_ PG11,GPIO_AF1
#define _LPTIM1_IN2_PB7_ 1
#define _LPTIM1_IN2_PC2_ 1
#define _LPTIM1_IN2_PG11_ 1

#define LPTIM1_OUT_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF1
#define LPTIM1_OUT_PB2_ PB2,GPIO_AF1
#define LPTIM1_OUT_PC1_ PC1,GPIO_AF1
#define LPTIM1_OUT_PG15_ PG15,GPIO_AF1
#define _LPTIM1_OUT_PA14 (JTCK/SWCLK)_ 1
#define _LPTIM1_OUT_PB2_ 1
#define _LPTIM1_OUT_PC1_ 1
#define _LPTIM1_OUT_PG15_ 1

#define LPTIM2_ETR_PA5_ PA5,GPIO_AF14
#define LPTIM2_ETR_PC3_ PC3,GPIO_AF14
#define LPTIM2_ETR_PD11_ PD11,GPIO_AF14
#define _LPTIM2_ETR_PA5_ 1
#define _LPTIM2_ETR_PC3_ 1
#define _LPTIM2_ETR_PD11_ 1

#define LPTIM2_IN1_PB1_ PB1,GPIO_AF14
#define LPTIM2_IN1_PC0_ PC0,GPIO_AF14
#define LPTIM2_IN1_PD12_ PD12,GPIO_AF14
#define _LPTIM2_IN1_PB1_ 1
#define _LPTIM2_IN1_PC0_ 1
#define _LPTIM2_IN1_PD12_ 1

#define LPTIM2_OUT_PA4_ PA4,GPIO_AF14
#define LPTIM2_OUT_PA8_ PA8,GPIO_AF14
#define LPTIM2_OUT_PD13_ PD13,GPIO_AF14
#define _LPTIM2_OUT_PA4_ 1
#define _LPTIM2_OUT_PA8_ 1
#define _LPTIM2_OUT_PD13_ 1

#define LPUART1_CTS_PA6_ PA6,GPIO_AF8
#define LPUART1_CTS_PB13_ PB13,GPIO_AF8
#define LPUART1_CTS_PG5_ PG5,GPIO_AF8
#define _LPUART1_CTS_PA6_ 1
#define _LPUART1_CTS_PB13_ 1
#define _LPUART1_CTS_PG5_ 1

#define LPUART1_DE_PB1_ PB1,GPIO_AF8
#define LPUART1_DE_PB12_ PB12,GPIO_AF8
#define LPUART1_DE_PG6_ PG6,GPIO_AF8
#define _LPUART1_DE_PB1_ 1
#define _LPUART1_DE_PB12_ 1
#define _LPUART1_DE_PG6_ 1

