susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32L49x.h
#define LPUART1_RTS_PB1_ PB1,GPIO_AF8
#define LPUART1_RTS_PB12_ PB12,GPIO_AF8
#define LPUART1_RTS_PG6_ PG6,GPIO_AF8
#define _LPUART1_RTS_PB1_ 1
#define _LPUART1_RTS_PB12_ 1
#define _LPUART1_RTS_PG6_ 1

#define LPUART1_RX_PA3_ PA3,GPIO_AF8
#define LPUART1_RX_PB10_ PB10,GPIO_AF8
#define LPUART1_RX_PC0_ PC0,GPIO_AF8
#define LPUART1_RX_PG8_ PG8,GPIO_AF8
#define _LPUART1_RX_PA3_ 1
#define _LPUART1_RX_PB10_ 1
#define _LPUART1_RX_PC0_ 1
#define _LPUART1_RX_PG8_ 1

#define LPUART1_TX_PA2_ PA2,GPIO_AF8
#define LPUART1_TX_PB11_ PB11,GPIO_AF8
#define LPUART1_TX_PC1_ PC1,GPIO_AF8
#define LPUART1_TX_PG7_ PG7,GPIO_AF8
#define _LPUART1_TX_PA2_ 1
#define _LPUART1_TX_PB11_ 1
#define _LPUART1_TX_PC1_ 1
#define _LPUART1_TX_PG7_ 1

#define QUADSPI_BK1_IO0_PB1_ PB1,GPIO_AF10
#define QUADSPI_BK1_IO0_PE12_ PE12,GPIO_AF10
#define QUADSPI_BK1_IO0_PF8_ PF8,GPIO_AF10
#define _QUADSPI_BK1_IO0_PB1_ 1
#define _QUADSPI_BK1_IO0_PE12_ 1
#define _QUADSPI_BK1_IO0_PF8_ 1

#define QUADSPI_BK1_IO1_PB0_ PB0,GPIO_AF10
#define QUADSPI_BK1_IO1_PE13_ PE13,GPIO_AF10
#define QUADSPI_BK1_IO1_PF9_ PF9,GPIO_AF10
#define _QUADSPI_BK1_IO1_PB0_ 1
#define _QUADSPI_BK1_IO1_PE13_ 1
#define _QUADSPI_BK1_IO1_PF9_ 1

#define QUADSPI_BK1_IO2_PA7_ PA7,GPIO_AF10
#define QUADSPI_BK1_IO2_PE14_ PE14,GPIO_AF10
#define QUADSPI_BK1_IO2_PF7_ PF7,GPIO_AF10
#define _QUADSPI_BK1_IO2_PA7_ 1
#define _QUADSPI_BK1_IO2_PE14_ 1
#define _QUADSPI_BK1_IO2_PF7_ 1

#define QUADSPI_BK1_IO3_PA6_ PA6,GPIO_AF10
#define QUADSPI_BK1_IO3_PE15_ PE15,GPIO_AF10
#define QUADSPI_BK1_IO3_PF6_ PF6,GPIO_AF10
#define _QUADSPI_BK1_IO3_PA6_ 1
#define _QUADSPI_BK1_IO3_PE15_ 1
#define _QUADSPI_BK1_IO3_PF6_ 1

#define QUADSPI_BK1_NCS_PA2_ PA2,GPIO_AF10
#define QUADSPI_BK1_NCS_PB11_ PB11,GPIO_AF10
#define QUADSPI_BK1_NCS_PE11_ PE11,GPIO_AF10
#define _QUADSPI_BK1_NCS_PA2_ 1
#define _QUADSPI_BK1_NCS_PB11_ 1
#define _QUADSPI_BK1_NCS_PE11_ 1

#define QUADSPI_BK2_IO0_PC1_ PC1,GPIO_AF10
#define QUADSPI_BK2_IO0_PD4_ PD4,GPIO_AF10
#define QUADSPI_BK2_IO0_PH2_ PH2,GPIO_AF3
#define _QUADSPI_BK2_IO0_PC1_ 1
#define _QUADSPI_BK2_IO0_PD4_ 1
#define _QUADSPI_BK2_IO0_PH2_ 1

#define QUADSPI_BK2_IO1_PC2_ PC2,GPIO_AF10
#define QUADSPI_BK2_IO1_PD5_ PD5,GPIO_AF10
#define QUADSPI_BK2_IO1_PD6_ PD6,GPIO_AF5
#define _QUADSPI_BK2_IO1_PC2_ 1
#define _QUADSPI_BK2_IO1_PD5_ 1
#define _QUADSPI_BK2_IO1_PD6_ 1

#define QUADSPI_BK2_IO2_PC3_ PC3,GPIO_AF10
#define QUADSPI_BK2_IO2_PD6_ PD6,GPIO_AF10
#define _QUADSPI_BK2_IO2_PC3_ 1
#define _QUADSPI_BK2_IO2_PD6_ 1

#define QUADSPI_BK2_IO3_PC4_ PC4,GPIO_AF10
#define QUADSPI_BK2_IO3_PD7_ PD7,GPIO_AF10
#define _QUADSPI_BK2_IO3_PC4_ 1
#define _QUADSPI_BK2_IO3_PD7_ 1

#define QUADSPI_BK2_NCS_PC11_ PC11,GPIO_AF5
#define QUADSPI_BK2_NCS_PD3_ PD3,GPIO_AF10
#define _QUADSPI_BK2_NCS_PC11_ 1
#define _QUADSPI_BK2_NCS_PD3_ 1

#define QUADSPI_CLK_PA3_ PA3,GPIO_AF10
#define QUADSPI_CLK_PB10_ PB10,GPIO_AF10
#define QUADSPI_CLK_PE10_ PE10,GPIO_AF10
#define QUADSPI_CLK_PF10_ PF10,GPIO_AF3
#define _QUADSPI_CLK_PA3_ 1
#define _QUADSPI_CLK_PB10_ 1
#define _QUADSPI_CLK_PE10_ 1
#define _QUADSPI_CLK_PF10_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define _RCC_MCO_PA8_ 1

#define RTC_OUT_ALARM_PB2_ PB2,GPIO_AF0
#define _RTC_OUT_ALARM_PB2_ 1

#define RTC_OUT_CALIB_PB2_ PB2,GPIO_AF0
#define _RTC_OUT_CALIB_PB2_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PB15_ 1

#define SAI1_EXTCLK_PA0_ PA0,GPIO_AF13
#define SAI1_EXTCLK_PB0_ PB0,GPIO_AF13
#define _SAI1_EXTCLK_PA0_ 1
#define _SAI1_EXTCLK_PB0_ 1

#define SAI1_FS_A_PA9_ PA9,GPIO_AF13
#define SAI1_FS_A_PB9_ PB9,GPIO_AF13
#define SAI1_FS_A_PE4_ PE4,GPIO_AF13
#define _SAI1_FS_A_PA9_ 1
#define _SAI1_FS_A_PB9_ 1
#define _SAI1_FS_A_PE4_ 1

#define SAI1_FS_B_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF13
#define SAI1_FS_B_PA4_ PA4,GPIO_AF13
#define SAI1_FS_B_PB6_ PB6,GPIO_AF13
#define SAI1_FS_B_PE9_ PE9,GPIO_AF13
#define SAI1_FS_B_PF9_ PF9,GPIO_AF13
#define _SAI1_FS_B_PA14 (JTCK/SWCLK)_ 1
#define _SAI1_FS_B_PA4_ 1
#define _SAI1_FS_B_PB6_ 1
#define _SAI1_FS_B_PE9_ 1
#define _SAI1_FS_B_PF9_ 1

#define SAI1_MCLK_A_PA3_ PA3,GPIO_AF13
#define SAI1_MCLK_A_PB8_ PB8,GPIO_AF13
#define SAI1_MCLK_A_PE2_ PE2,GPIO_AF13
#define SAI1_MCLK_A_PG7_ PG7,GPIO_AF13
#define _SAI1_MCLK_A_PA3_ 1
#define _SAI1_MCLK_A_PB8_ 1
#define _SAI1_MCLK_A_PE2_ 1
#define _SAI1_MCLK_A_PG7_ 1

#define SAI1_MCLK_B_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF13
#define SAI1_MCLK_B_PE10_ PE10,GPIO_AF13
#define SAI1_MCLK_B_PF7_ PF7,GPIO_AF13
#define _SAI1_MCLK_B_PB4 (NJTRST)_ 1
#define _SAI1_MCLK_B_PE10_ 1
#define _SAI1_MCLK_B_PF7_ 1

#define SAI1_SCK_A_PA8_ PA8,GPIO_AF13
#define SAI1_SCK_A_PB10_ PB10,GPIO_AF13
#define SAI1_SCK_A_PE5_ PE5,GPIO_AF13
#define _SAI1_SCK_A_PA8_ 1
#define _SAI1_SCK_A_PB10_ 1
#define _SAI1_SCK_A_PE5_ 1

#define SAI1_SCK_B_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF13
#define SAI1_SCK_B_PE8_ PE8,GPIO_AF13
#define SAI1_SCK_B_PF8_ PF8,GPIO_AF13
#define _SAI1_SCK_B_PB3 (JTDO/TRACESWO)_ 1
#define _SAI1_SCK_B_PE8_ 1
#define _SAI1_SCK_B_PF8_ 1

#define SAI1_SD_A_PA10_ PA10,GPIO_AF13
#define SAI1_SD_A_PC1_ PC1,GPIO_AF13
#define SAI1_SD_A_PC3_ PC3,GPIO_AF13
#define SAI1_SD_A_PD6_ PD6,GPIO_AF13
#define SAI1_SD_A_PE6_ PE6,GPIO_AF13
#define _SAI1_SD_A_PA10_ 1
#define _SAI1_SD_A_PC1_ 1
#define _SAI1_SD_A_PC3_ 1
#define _SAI1_SD_A_PD6_ 1
#define _SAI1_SD_A_PE6_ 1

#define SAI1_SD_B_PA13 (JTMS/SWDIO)_ PA13 (JTMS/SWDIO),GPIO_AF13
#define SAI1_SD_B_PB5_ PB5,GPIO_AF13
#define SAI1_SD_B_PE3_ PE3,GPIO_AF13
#define SAI1_SD_B_PE7_ PE7,GPIO_AF13
#define SAI1_SD_B_PF6_ PF6,GPIO_AF13
#define _SAI1_SD_B_PA13 (JTMS/SWDIO)_ 1
#define _SAI1_SD_B_PB5_ 1
#define _SAI1_SD_B_PE3_ 1
#define _SAI1_SD_B_PE7_ 1
#define _SAI1_SD_B_PF6_ 1

#define SAI2_EXTCLK_PA2_ PA2,GPIO_AF13
#define SAI2_EXTCLK_PC9_ PC9,GPIO_AF13
#define _SAI2_EXTCLK_PA2_ 1
#define _SAI2_EXTCLK_PC9_ 1

#define SAI2_FS_A_PB12_ PB12,GPIO_AF13
#define SAI2_FS_A_PD12_ PD12,GPIO_AF13
#define SAI2_FS_A_PG10_ PG10,GPIO_AF13
#define _SAI2_FS_A_PB12_ 1
#define _SAI2_FS_A_PD12_ 1
#define _SAI2_FS_A_PG10_ 1

#define SAI2_FS_B_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF13
#define SAI2_FS_B_PG3_ PG3,GPIO_AF13
#define _SAI2_FS_B_PA15 (JTDI)_ 1
#define _SAI2_FS_B_PG3_ 1

#define SAI2_MCLK_A_PB14_ PB14,GPIO_AF13
#define SAI2_MCLK_A_PC6_ PC6,GPIO_AF13
#define SAI2_MCLK_A_PD9_ PD9,GPIO_AF13
#define SAI2_MCLK_A_PG11_ PG11,GPIO_AF13
#define _SAI2_MCLK_A_PB14_ 1
#define _SAI2_MCLK_A_PC6_ 1
#define _SAI2_MCLK_A_PD9_ 1
#define _SAI2_MCLK_A_PG11_ 1

